{"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_1", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "sparse": false, "name": "input_1"}}, {"class_name": "Conv2D", "name": "conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [2, 2], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "name": "conv1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 64, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [7, 7]}}, {"class_name": "BatchNormalization", "name": "bn_conv1", "inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn_conv1", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["bn_conv1", 0, 0, {}]]], "config": {"name": "activation_1", "trainable": false, "activation": "relu"}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2, 2], "name": "max_pooling2d_1", "trainable": false, "pool_size": [3, 3], "data_format": "channels_last"}}, {"class_name": "Conv2D", "name": "res2a_branch2a", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "name": "res2a_branch2a", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 64, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "BatchNormalization", "name": "bn2a_branch2a", "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn2a_branch2a", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]], "config": {"name": "activation_2", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res2a_branch2b", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "name": "res2a_branch2b", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 64, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "name": "bn2a_branch2b", "inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn2a_branch2b", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Activation", "name": "activation_3", "inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]], "config": {"name": "activation_3", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res2a_branch2c", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "name": "res2a_branch2c", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 256, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "Conv2D", "name": "res2a_branch1", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "name": "res2a_branch1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 256, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "BatchNormalization", "name": "bn2a_branch2c", "inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn2a_branch2c", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "BatchNormalization", "name": "bn2a_branch1", "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn2a_branch1", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Add", "name": "add_1", "inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]], "config": {"name": "add_1", "trainable": false}}, {"class_name": "Activation", "name": "activation_4", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"name": "activation_4", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res2b_branch2a", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "name": "res2b_branch2a", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 64, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "BatchNormalization", "name": "bn2b_branch2a", "inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn2b_branch2a", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Activation", "name": "activation_5", "inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]], "config": {"name": "activation_5", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res2b_branch2b", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "name": "res2b_branch2b", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 64, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "name": "bn2b_branch2b", "inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn2b_branch2b", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Activation", "name": "activation_6", "inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]], "config": {"name": "activation_6", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res2b_branch2c", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "name": "res2b_branch2c", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 256, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "BatchNormalization", "name": "bn2b_branch2c", "inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn2b_branch2c", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Add", "name": "add_2", "inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_4", 0, 0, {}]]], "config": {"name": "add_2", "trainable": false}}, {"class_name": "Activation", "name": "activation_7", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"name": "activation_7", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res2c_branch2a", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "name": "res2c_branch2a", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 64, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "BatchNormalization", "name": "bn2c_branch2a", "inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn2c_branch2a", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Activation", "name": "activation_8", "inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]], "config": {"name": "activation_8", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res2c_branch2b", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "name": "res2c_branch2b", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 64, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "name": "bn2c_branch2b", "inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn2c_branch2b", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Activation", "name": "activation_9", "inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]], "config": {"name": "activation_9", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res2c_branch2c", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "name": "res2c_branch2c", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 256, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "BatchNormalization", "name": "bn2c_branch2c", "inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn2c_branch2c", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Add", "name": "add_3", "inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_7", 0, 0, {}]]], "config": {"name": "add_3", "trainable": false}}, {"class_name": "Activation", "name": "activation_10", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"name": "activation_10", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3a_branch2a", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [2, 2], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "name": "res3a_branch2a", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 128, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "BatchNormalization", "name": "bn3a_branch2a", "inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn3a_branch2a", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Activation", "name": "activation_11", "inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]], "config": {"name": "activation_11", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3a_branch2b", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "name": "res3a_branch2b", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 128, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "name": "bn3a_branch2b", "inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn3a_branch2b", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Activation", "name": "activation_12", "inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]], "config": {"name": "activation_12", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3a_branch2c", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "name": "res3a_branch2c", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 512, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "Conv2D", "name": "res3a_branch1", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [2, 2], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "name": "res3a_branch1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 512, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "BatchNormalization", "name": "bn3a_branch2c", "inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn3a_branch2c", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "BatchNormalization", "name": "bn3a_branch1", "inbound_nodes": [[["res3a_branch1", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn3a_branch1", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Add", "name": "add_4", "inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]], "config": {"name": "add_4", "trainable": false}}, {"class_name": "Activation", "name": "activation_13", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"name": "activation_13", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3b_branch2a", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "name": "res3b_branch2a", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 128, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "BatchNormalization", "name": "bn3b_branch2a", "inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn3b_branch2a", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Activation", "name": "activation_14", "inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]], "config": {"name": "activation_14", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3b_branch2b", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "name": "res3b_branch2b", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 128, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "name": "bn3b_branch2b", "inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn3b_branch2b", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Activation", "name": "activation_15", "inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]], "config": {"name": "activation_15", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3b_branch2c", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "name": "res3b_branch2c", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 512, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "BatchNormalization", "name": "bn3b_branch2c", "inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn3b_branch2c", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Add", "name": "add_5", "inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["activation_13", 0, 0, {}]]], "config": {"name": "add_5", "trainable": false}}, {"class_name": "Activation", "name": "activation_16", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"name": "activation_16", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3c_branch2a", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "name": "res3c_branch2a", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 128, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "BatchNormalization", "name": "bn3c_branch2a", "inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn3c_branch2a", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Activation", "name": "activation_17", "inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]], "config": {"name": "activation_17", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3c_branch2b", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "name": "res3c_branch2b", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 128, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "name": "bn3c_branch2b", "inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn3c_branch2b", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Activation", "name": "activation_18", "inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]], "config": {"name": "activation_18", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3c_branch2c", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "name": "res3c_branch2c", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 512, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "BatchNormalization", "name": "bn3c_branch2c", "inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn3c_branch2c", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Add", "name": "add_6", "inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["activation_16", 0, 0, {}]]], "config": {"name": "add_6", "trainable": false}}, {"class_name": "Activation", "name": "activation_19", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"name": "activation_19", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3d_branch2a", "inbound_nodes": [[["activation_19", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "name": "res3d_branch2a", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 128, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "BatchNormalization", "name": "bn3d_branch2a", "inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn3d_branch2a", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Activation", "name": "activation_20", "inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]], "config": {"name": "activation_20", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3d_branch2b", "inbound_nodes": [[["activation_20", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "name": "res3d_branch2b", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 128, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "name": "bn3d_branch2b", "inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn3d_branch2b", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Activation", "name": "activation_21", "inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]], "config": {"name": "activation_21", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3d_branch2c", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "name": "res3d_branch2c", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 512, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "BatchNormalization", "name": "bn3d_branch2c", "inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn3d_branch2c", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Add", "name": "add_7", "inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["activation_19", 0, 0, {}]]], "config": {"name": "add_7", "trainable": false}}, {"class_name": "Activation", "name": "activation_22", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"name": "activation_22", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res4a_branch2a", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [2, 2], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "name": "res4a_branch2a", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 256, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "BatchNormalization", "name": "bn4a_branch2a", "inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn4a_branch2a", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Activation", "name": "activation_23", "inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]], "config": {"name": "activation_23", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res4a_branch2b", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "name": "res4a_branch2b", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 256, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "name": "bn4a_branch2b", "inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn4a_branch2b", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Activation", "name": "activation_24", "inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]], "config": {"name": "activation_24", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res4a_branch2c", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "name": "res4a_branch2c", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 1024, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "Conv2D", "name": "res4a_branch1", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [2, 2], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "name": "res4a_branch1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 1024, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "BatchNormalization", "name": "bn4a_branch2c", "inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn4a_branch2c", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "BatchNormalization", "name": "bn4a_branch1", "inbound_nodes": [[["res4a_branch1", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn4a_branch1", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Add", "name": "add_8", "inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]], "config": {"name": "add_8", "trainable": false}}, {"class_name": "Activation", "name": "activation_25", "inbound_nodes": [[["add_8", 0, 0, {}]]], "config": {"name": "activation_25", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res4b_branch2a", "inbound_nodes": [[["activation_25", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "name": "res4b_branch2a", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 256, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "BatchNormalization", "name": "bn4b_branch2a", "inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn4b_branch2a", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Activation", "name": "activation_26", "inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]], "config": {"name": "activation_26", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res4b_branch2b", "inbound_nodes": [[["activation_26", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "name": "res4b_branch2b", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 256, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "name": "bn4b_branch2b", "inbound_nodes": [[["res4b_branch2b", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn4b_branch2b", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Activation", "name": "activation_27", "inbound_nodes": [[["bn4b_branch2b", 0, 0, {}]]], "config": {"name": "activation_27", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res4b_branch2c", "inbound_nodes": [[["activation_27", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "name": "res4b_branch2c", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 1024, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "BatchNormalization", "name": "bn4b_branch2c", "inbound_nodes": [[["res4b_branch2c", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn4b_branch2c", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Add", "name": "add_9", "inbound_nodes": [[["bn4b_branch2c", 0, 0, {}], ["activation_25", 0, 0, {}]]], "config": {"name": "add_9", "trainable": false}}, {"class_name": "Activation", "name": "activation_28", "inbound_nodes": [[["add_9", 0, 0, {}]]], "config": {"name": "activation_28", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res4c_branch2a", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "name": "res4c_branch2a", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 256, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [1, 1]}}, {"class_name": "BatchNormalization", "name": "bn4c_branch2a", "inbound_nodes": [[["res4c_branch2a", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn4c_branch2a", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Activation", "name": "activation_29", "inbound_nodes": [[["bn4c_branch2a", 0, 0, {}]]], "config": {"name": "activation_29", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res4c_branch2b", "inbound_nodes": [[["activation_29", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "trainable": false, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "name": "res4c_branch2b", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "filters": 256, "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "BatchNormalization", "name": "bn4c_branch2b", "inbound_nodes": [[["res4c_branch2b", 0, 0, {}]]], "config": {"axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "bn4c_branch2b", "trainable": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "beta_constraint": null, "epsilon": 0.001}}, {"class_name": "Activation", "name": "activation_30", "inbound_nodes": [[["bn4c_branch2b", 0, 0, {}]]], "config": {"name": "activation_30", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res4c_branch2c", "inbound_nodes": [[["activation_30", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "trainable": false, 